toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
#include <msp430.h>
#include <cstdint>
#include <cstdbool>
#include <cstddef>
#include <atomic>
#include "Toastbox/Scheduler.h"
#include "SDCard.h"
#include "ICE.h"
#include "ImgSensor.h"
#include "ImgAutoExposure.h"
#include "Startup.h"
#include "GPIO.h"
#include "Clock.h"
#include "RTC.h"
#include "SPI.h"
#include "SysTick.h"
#include "RegLocker.h"
#include "MSP.h"
#include "GetBits.h"
#include "ImgSD.h"
#include "I2C.h"
#include "OutputPriority.h"
#include "BatterySampler.h"
#include "Button.h"
#include "AssertionCounter.h"
#include "Triggers.h"
#include "Motion.h"
#include "SuppressibleAssertion.h"
#include "Assert.h"
#include "Timer.h"
using namespace GPIO;

static constexpr uint32_t _XT1FreqHz        = 32768;
static constexpr uint32_t _ACLKFreqHz       = _XT1FreqHz;
static constexpr uint64_t _MCLKFreqHz       = 16000000;
static constexpr uint32_t _SysTickPeriodUs  = 512;

struct _Pin {
    // Port A
    using VDD_B_1V8_IMG_SD_EN       = PortA::Pin<0x0, Option::Output0>;
    using LED_GREEN_                = PortA::Pin<0x1, Option::Output1>;
    using MSP_STM_I2C_SDA           = PortA::Pin<0x2>;
    using MSP_STM_I2C_SCL           = PortA::Pin<0x3>;
    using ICE_MSP_SPI_DATA_OUT      = PortA::Pin<0x4>;
    using ICE_MSP_SPI_DATA_IN       = PortA::Pin<0x5>;
    using ICE_MSP_SPI_CLK           = PortA::Pin<0x6>;
    using BAT_CHRG_LVL              = PortA::Pin<0x7, Option::Input>; // No pullup/pulldown because this is an analog input (and the voltage divider provides a physical pulldown)
    using MSP_XOUT                  = PortA::Pin<0x8>;
    using MSP_XIN                   = PortA::Pin<0x9>;
    using LED_RED_                  = PortA::Pin<0xA, Option::Output1>;
    using VDD_B_2V8_IMG_SD_EN       = PortA::Pin<0xB, Option::Output0>;
    using MOTION_SIGNAL             = PortA::Pin<0xC>;
    using BUTTON_SIGNAL_            = PortA::Pin<0xD>;
    using BAT_CHRG_LVL_EN_          = PortA::Pin<0xE, Option::Output1>;
    using VDD_B_3V3_STM             = PortA::Pin<0xF, Option::Input, Option::Resistor0>;
    
    // Port B
    using MOTION_EN_                = PortB::Pin<0x0>;
    using VDD_B_EN                  = PortB::Pin<0x1, Option::Output0>;
    using _UNUSED0                  = PortB::Pin<0x2>;
};

class _TaskButton;
class _TaskEvent;
class _TaskSD;
class _TaskImg;
class _TaskI2C;
class _TaskMotion;

static void _Sleep();

[[noreturn]]
static void _SchedulerStackOverflow();

#warning TODO: disable stack guard for production
static constexpr size_t _StackGuardCount = 16;

using _Scheduler = Toastbox::Scheduler<
    _SysTickPeriodUs,                           // T_UsPerTick: microseconds per tick
    
    _Sleep,                                     // T_Sleep: function to put processor to sleep;
                                                //          invoked when no tasks have work to do
    
    _StackGuardCount,                           // T_StackGuardCount: number of pointer-sized stack guard elements to use
    _SchedulerStackOverflow,                    // T_StackOverflow: function to handle stack overflow
    nullptr,                                    // T_StackInterrupt: unused
    
    // T_Tasks: list of tasks
    _TaskButton,
    _TaskEvent,
    _TaskSD,
    _TaskImg,
    _TaskI2C,
    _TaskMotion
>;

using _Clock = ClockType<_XT1FreqHz, _MCLKFreqHz>;
using _SysTick = T_SysTick<_MCLKFreqHz, _SysTickPeriodUs>;
using _SPI = SPIType<_MCLKFreqHz, _Pin::ICE_MSP_SPI_CLK, _Pin::ICE_MSP_SPI_DATA_OUT, _Pin::ICE_MSP_SPI_DATA_IN>;
using _ICE = ICE<_Scheduler>;

using _I2C = I2CType<_Scheduler, _Pin::MSP_STM_I2C_SCL, _Pin::MSP_STM_I2C_SDA, _Pin::VDD_B_3V3_STM, MSP::I2CAddr>;
using _Motion = T_Motion<_Scheduler, _Pin::MOTION_EN_, _Pin::MOTION_SIGNAL>;

using _BatterySampler = BatterySamplerType<_Scheduler, _Pin::BAT_CHRG_LVL, _Pin::BAT_CHRG_LVL_EN_>;

constexpr uint16_t _ButtonHoldDurationMs = 1500;
using _Button = ButtonType<_Scheduler, _Pin::BUTTON_SIGNAL_, _ButtonHoldDurationMs>;

static OutputPriority _LEDGreen_(_Pin::LED_GREEN_{});
static OutputPriority _LEDRed_(_Pin::LED_RED_{});

struct _LEDPriority {
    static constexpr uint8_t Power   = 0;
    static constexpr uint8_t Capture = 1;
    static constexpr uint8_t I2C     = 2;
    static constexpr uint8_t Default = 3;
};

// _ImgSensor: image sensor object
using _ImgSensor = Img::Sensor<
    _Scheduler,             // T_Scheduler
    _ICE                    // T_ICE
>;

// _SDCard: SD card object
using _SDCard = SD::Card<
    _Scheduler,         // T_Scheduler
    _ICE,               // T_ICE
    1,                  // T_ClkDelaySlow (odd values invert the clock)
    6                   // T_ClkDelayFast (odd values invert the clock)
>;

// _RTC: real time clock
using _RTC = RTCType<_XT1FreqHz, _Pin::MSP_XOUT, _Pin::MSP_XIN, _Scheduler>;

// _State: stores MSPApp persistent state, intended to be read/written by outside world
// Stored in FRAM because it needs to persist indefinitely.
[[gnu::section(".persistent")]]
static MSP::State _State = {
    .header = MSP::StateHeader,
};

static void _TaskEventRunningUpdate();
static void _HostModeUpdate() { _TaskEventRunningUpdate(); }
static void _PoweredUpdate() { _TaskEventRunningUpdate(); }
static void _CaffeineUpdate() {}
static void _MotionEnabledUpdate();
static void _VDDBEnabledUpdate();
static void _VDDIMGSDEnabledUpdate();

// _HostMode: events pause/resume (for host mode)
using _HostMode = T_AssertionCounter<_HostModeUpdate>;

// _Powered: power state assertion (the user-facing power state)
using _Powered = T_AssertionCounter<_PoweredUpdate>;

// _Caffeine: prevents sleep
using _Caffeine = T_AssertionCounter<_CaffeineUpdate>;

// Motion enable/disable
using _MotionEnabled = T_AssertionCounter<_MotionEnabledUpdate>;
using _MotionEnabledAssertion = T_SuppressibleAssertion<_MotionEnabled>;

// VDDB enable/disable
using _VDDBEnabled = T_AssertionCounter<_VDDBEnabledUpdate>;

// VDDIMGSD enable/disable
using _VDDIMGSDEnabled = T_AssertionCounter<_VDDIMGSDEnabledUpdate>;

// _Triggers: stores our current event state
using _Triggers = T_Triggers<_State, _MotionEnabledAssertion>;

