toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    SchedulerStack(".stack._TaskImg")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskEvent

struct _TaskEvent {
    static void Start() {
        _Scheduler::Start<_TaskEvent>();
    }
    
    static void Reset() {
        // Reset other tasks' state
        // This is necessary because we're stopping them at an arbitrary point
        _TaskSD::Reset();
        _TaskImg::Reset();
        // Stop tasks
        _Scheduler::Stop<_TaskSD>();
        _Scheduler::Stop<_TaskImg>();
        _Scheduler::Stop<_TaskEvent>();
        // Reset our state
        // We do this last so that our power assertions are reset last
        _State = {};
    }
    
    static void _TimeTrigger(_Triggers::TimeTriggerEvent& ev) {
        _Triggers::TimeTrigger& trigger = ev.trigger();
        // Schedule the CaptureImageEvent, but only if we're not in fast-forward mode
        if (!_State.fastForward) {
            CaptureStart(trigger, ev.time);
        }
        // Reschedule TimeTriggerEvent for its next trigger time
        EventInsert(ev, ev.repeat);
    }
    
    static void _MotionEnable(_Triggers::MotionEnableEvent& ev) {
        _Triggers::MotionTrigger& trigger = ev.trigger();
        
        // Enable motion
        trigger.enabled.set(true);
        
        // Schedule the MotionDisable event, if applicable
        // This needs to happen before we reschedule `motionEnableEvent` because we need its .time to
        // properly schedule the MotionDisableEvent!
        const uint32_t durationTicks = trigger.base().durationTicks;
        if (durationTicks) {
            EventInsert((_Triggers::MotionDisableEvent&)trigger, ev.time, durationTicks);
        }
        
        // Reschedule MotionEnableEvent for its next trigger time
        EventInsert(ev, ev.repeat);
    }
    
    static void _MotionDisable(_Triggers::MotionDisableEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        trigger.enabled.set(false);
    }
    
    static void _MotionUnsuppress(_Triggers::MotionUnsuppressEvent& ev) {
        // We should never get a MotionUnsuppressEvent event while in fast-forward mode
        Assert(!_State.fastForward);
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        trigger.enabled.suppress(false);
    }
    
    static void _CaptureImage(_Triggers::CaptureImageEvent& ev) {
        // We should never get a CaptureImageEvent event while in fast-forward mode
        Assert(!_State.fastForward);
        
        constexpr MSP::ImgRingBuf& imgRingBuf = ::_State.sd.imgRingBufs[0];
        
        const bool green = ev.capture->leds & MSP::LEDs_::Green;
        const bool red = ev.capture->leds & MSP::LEDs_::Red;
        _LEDGreen_.set(_LEDPriority::Capture, !green);
        _LEDRed_.set(_LEDPriority::Capture, !red);
        
        // Turn on VDD_B power (turns on ICE40)
        _State.vddb = true;
        
        // Wait for ICE40 to start
        // We specify (within the bitstream itself, via icepack) that ICE40 should load
        // the bitstream at high-frequency (40 MHz).
        // According to the datasheet, this takes 70ms.
        _Scheduler::Sleep(_Scheduler::Ms(30));
        _ICEInit();
        
        // Reset SD nets before we turn on SD power
        _TaskSD::CardReset();
        _TaskSD::Wait();
        
        // Turn on IMG/SD power
        _State.vddImgSd = true;
        
        // Init image sensor / SD card
        _TaskImg::SensorInit();
        _TaskSD::CardInit();
        
        // Capture an image
        {
            // Wait until _TaskSD has initialized _State.sd (since we're about to refer to
            // _State.sd.imgRingBufs), and for any previous writing to be complete (because
            // the SDRAM is single-port, so we can't write an image to RAM until we're done
            // copying an image from RAM -> SD card).
            _Scheduler::Wait([] { return _TaskSD::SDStateReady() && !_TaskSD::Writing(); });
            
            // Capture image to RAM
            _TaskImg::Capture(imgRingBuf.buf.id);
            const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
            
            // Copy image from RAM -> SD card
            _TaskSD::Write(srcRAMBlock);
            _TaskSD::Wait();
        }
        
        _LEDGreen_.set(_LEDPriority::Capture, std::nullopt);
        _LEDRed_.set(_LEDPriority::Capture, std::nullopt);
        
        _State.vddImgSd = false;
        _State.vddb = false;
        
        ev.countRem--;
        if (ev.countRem) {
            EventInsert(ev, ev.time, ev.capture->delayTicks);
        }
    }
    
    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time) {
        _Triggers::EventInsert(ev, time);
        // If this event is now the front of the list, reschedule _EventTimer
        if (_Triggers::EventFront() == &ev) {
            _EventTimerSchedule();
        }
    }

    static void EventInsert(_Triggers::Event& ev, MSP::Repeat& repeat) {
        const Time::Ticks delta = _RepeatAdvance(repeat);
        // delta=0 means Repeat=never, in which case we don't reschedule the event
        if (delta) {
            EventInsert(ev, ev.time+delta);
        }
    }

    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time, uint32_t deltaTicks) {
        EventInsert(ev, time + deltaTicks);
    }

    static void CaptureStart(_Triggers::CaptureImageEvent& ev, const Time::Instant& time) {
        // Reset capture count
        ev.countRem = ev.capture->count;
        if (ev.countRem) {
            EventInsert(ev, time);
        }
    }
    
    static void _EventTimerSchedule() {
        _Triggers::Event* ev = _Triggers::EventFront();
        if (ev) {
            _EventTimer::Schedule(ev->time);
        } else {
            _EventTimer::Reset();
        }
    }
    
//    static void _EventTimerSchedule(const Time::Instant& time) {
//        if (time) {
//            _EventTimer::Schedule(time);
//        } else {
//            _EventTimer::Reset();
//        }
//    }
    
    // _EventPop(): pops an event from the front of the list if it's ready to be handled
    // Interrupts must be disabled
    static _Triggers::Event& _EventPop() {
        _Triggers::Event* ev = _Triggers::EventFront();
        Assert(ev); // We must have an event at this point, or else we have a logic error
        _Triggers::EventPop();
        // Schedule _EventTimer for the next event
        _EventTimerSchedule();
        return *ev;
        
//        // If the event occurs after the current time, don't pop it yet
//        if (ev && ev->time>=_RTC::Now()) ev = nullptr;
//        // If we're returning an event, pop it from the list
//        if (ev) _Triggers::EventPop();
//        // Exit fast-forward mode when we no longer have any events in the past
//        if (!ev) _State.fastForward = false;
//        
//        // If we're not fast-forwarding, and we either (1) popped an event, or (2) _WakeTimer
//        // isn't running, then schedule _WakeTimer. (2) is necessary for the initial case
//        // when we just exited fast-forward mode, in which case we won't return an event,
//        // but we do need to set the _WakeTimer (for the first time).
//        if (!_State.fastForward && (ev || !_WakeTimer::Running())) {
//            _Triggers::Event*const next = _Triggers::EventFront();
//            _WakeTimer::Schedule(next ? next->time : 0);
//            
////            if (next) _WakeTimer::Schedule(next->time);
////            else      _WakeTimer::Reset();
//        }
        
//        // If there's no front event, or the front event occurs after the current time, no events are ready yet.
//        if (!ev || ev->time>=_RTC::Now()) {
//            // Exit fast-forward mode when we no longer have any events in the past
//            _State.fastForward = false;
//            ev = nullptr;
//        }
//        
//        if (ev) _Triggers::EventPop();
//        
//        _Triggers::Event* ev = _Triggers::EventPop(_RTC::Now());
//        // Exit fast-forward mode when we no longer have any events in the past
//        if (!ev) {
//            _State.fastForward = false;
//        }
//        
//        return ev;
    }
    
    static bool _EventTimerFired() {
        const bool fired = _EventTimer::Fired();
        // Exit fast-forward mode the first time we have an event that's in the future
        if (!fired) _State.fastForward = false;
        return fired;
        
//        _Triggers::Event* ev = _Triggers::EventFront();
//        // If the event occurs after the current time, don't pop it yet
//        if (ev && ev->time>=_RTC::Now()) ev = nullptr;
//        // If we're returning an event, pop it from the list
//        if (ev) _Triggers::EventPop();
//        // Exit fast-forward mode when we no longer have any events in the past
//        if (!ev) _State.fastForward = false;
//        
//        // If we're not fast-forwarding, and we either (1) popped an event, or (2) _WakeTimer
//        // isn't running, then schedule _WakeTimer. (2) is necessary for the initial case
//        // when we just exited fast-forward mode, in which case we won't return an event,
//        // but we do need to set the _WakeTimer (for the first time).
//        if (!_State.fastForward && (ev || !_WakeTimer::Running())) {
//            _Triggers::Event*const next = _Triggers::EventFront();
//            _WakeTimer::Schedule(next ? next->time : 0);
//            
////            if (next) _WakeTimer::Schedule(next->time);
////            else      _WakeTimer::Reset();
//        }
        
//        // If there's no front event, or the front event occurs after the current time, no events are ready yet.
//        if (!ev || ev->time>=_RTC::Now()) {
//            // Exit fast-forward mode when we no longer have any events in the past
//            _State.fastForward = false;
//            ev = nullptr;
//        }
//        
//        if (ev) _Triggers::EventPop();
//        
//        _Triggers::Event* ev = _Triggers::EventPop(_RTC::Now());
//        // Exit fast-forward mode when we no longer have any events in the past
//        if (!ev) {
//            _State.fastForward = false;
//        }
//        
//        return ev;
    }
    
