toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    static constexpr auto& Stack = _TaskButtonStack;
};

// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::Set(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

// MARK: - Sleep

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    // If deep sleep is OK, enter LPM3.5 sleep, where RAM content is lost.
    // Otherwise, enter LPM1 sleep, because something is running.
    
//    const uint16_t mode = (_PowerAssertion::Asserted() ? LPM1_bits : LPM3_bits);
    
//    // If nothing asserts that we remained powered, enter LPM3.5
//    if (!_PowerAssertion::Asserted()) {
//        PMMUnlock pmm; // Unlock PMM registers
//        PMMCTL0_L |= PMMREGOFF_L;
//    }
    
    if (_Scheduler::WakeDeadline()) {
        // We have tasks that are sleeping towards a deadline, so enable SysTick
        #warning TODO: enable SysTick
    } else {
        // There's no deadline to wakeup No tasks are sleeping towards a deadline, so disable SysTick and set an alarm to wake up for the next event
        #warning TODO: disable SysTick
    }
    
    // Remember our current interrupt state, which IntState will restore upon return
    Toastbox::IntState ints;
    // Atomically enable interrupts and go to sleep
    __bis_SR_register(GIE | LPM3_bits);
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC::ISR(RTCIV);
    if (_EventTimer::ISRRTCInterested()) {
        _EventTimer::ISRRTC();
        // Wake if the timer fired
        if (_EventTimer::Fired()) {
            __bic_SR_register_on_exit(LPM3_bits);
        }
    }
}

[[gnu::interrupt(TIMER0_A1_VECTOR)]]
static void _ISR_Timer0() {
    _EventTimer::ISRTimer0(TA0IV);
    // Wake if the timer fired
    if (_EventTimer::Fired()) {
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (__even_in_range(iv, 0x10)) {
    
    // Motion
    case _Pin::MOTION_SIGNAL::IVPort2():
        _Motion::ISR();
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    // I2C (ie VDD_B_3V3_STM)
    case _I2C::Pin::Active::IVPort2():
        _I2C::ISR_Active(iv);
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    // Button
    case _Button::Pin::IVPort2():
        _Button::ISR();
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(USCI_B0_VECTOR)]]
static void _ISR_USCI_B0() {
    // Accessing `UCB0IV` automatically clears the highest-priority interrupt
    const uint16_t iv = UCB0IV;
    _I2C::ISR_I2C(iv);
    // Wake ourself
    __bic_SR_register_on_exit(LPM0_bits);
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

[[gnu::interrupt(ADC_VECTOR)]]
static void _ISR_ADC() {
    _BatterySampler::ISR(ADCIV);
    // Wake ourself
    __bic_SR_register_on_exit(LPM3_bits);
}

// MARK: - Abort

[[noreturn]]
static void _SchedulerStackOverflow() {
    Assert(false);
}

static void _AbortRecord(const Time::Instant& timestamp, uintptr_t addr) {
    using namespace MSP;
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    AbortHistory* hist = nullptr;
    for (AbortHistory& h : _State.aborts) {
        if (!h.count || h.addr==addr) {
            hist = &h;
            break;
        }
    }
    
    // If we don't have a place to record the abort, bail
    if (!hist) return;
    
    // Prep the element if this is the first instance
    if (!hist->count) {
        hist->addr = addr;
        hist->earliest = timestamp;
    }
    
    hist->latest = timestamp;
    hist->count++;
}

[[noreturn]]
static void _BOR() {
    PMMUnlock pmm; // Unlock PMM registers
    PMMCTL0_L |= PMMSWBOR_L;
    // Wait for reset
    for (;;);
}

// Abort(): called various Assert's throughout our program
extern "C"
[[noreturn, gnu::used]]
void Abort(uintptr_t addr) {
    const Time::Instant timestamp = _RTC::Now();
    // Record the abort
    _AbortRecord(timestamp, addr);
    _BOR();
}

extern "C"
[[noreturn]]
void abort() {
    Assert(false);
}

extern "C"
int atexit(void (*)(void)) {
    return 0;
}

// MARK: - Main

//extern "C" void Blink() {
//    for (;;) {
//        _Pin::LED_GREEN_::Write(0);
//        for (volatile uint16_t i=0; i<50000; i++);
//        _Pin::LED_GREEN_::Write(1);
//        for (volatile uint16_t i=0; i<50000; i++);
//    }
//}

int main() {
    // Invokes the first task's Run() function (_TaskButton::Run)
    _Scheduler::Run();
}
